#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.invitations.random_id.bucket: Refreshing state... [id=9Gw7CQ]
module.s3website["davidbornitz.dev"].random_id.bucket: Refreshing state... [id=OkYQpA]
module.s3website["resume.davidbornitz.dev"].random_id.bucket: Refreshing state... [id=wemegA]
module.invitations.aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=E2BP1AO2KL43L]
module.invitations.aws_dynamodb_table.invitation: Refreshing state... [id=invitation]
module.invitations.aws_cloudfront_public_key.invitation: Refreshing state... [id=K7Y686Q2ZTZD3]
module.s3website["davidbornitz.dev"].aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=EY0LKW0B60BRA]
aws_route53_zone.davidbornitz: Refreshing state... [id=Z04601461HBLV7APEL0VR]
module.s3website["resume.davidbornitz.dev"].aws_s3_bucket.bucket: Refreshing state... [id=resume.davidbornitz.dev-c1e99e80]
module.s3website["davidbornitz.dev"].aws_s3_bucket.bucket: Refreshing state... [id=davidbornitz.dev-3a4610a4]
module.invitations.aws_sns_topic.invitation_updates: Refreshing state... [id=arn:aws:sns:us-east-2:085879623427:invitation-updates]
module.invitations.aws_s3_bucket.bucket: Refreshing state... [id=invitation.davidbornitz.dev-f46c3b09]
module.s3website["resume.davidbornitz.dev"].aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=E1QIDDPCEV6TGP]
aws_cloudfront_origin_access_control.davidbornitz: Refreshing state... [id=E2IARHGO3S8MHZ]
module.invitations.aws_cognito_identity_pool.invitation: Refreshing state... [id=us-east-2:7a98c47f-5732-41b8-a772-7d5fd220f6ed]
aws_acm_certificate.davidbornitz: Refreshing state... [id=arn:aws:acm:us-east-1:085879623427:certificate/0c98caac-a15d-43ff-acfb-5215ebc4a3fb]
module.invitations.aws_cloudfront_key_group.invitation: Refreshing state... [id=c967c287-868f-44c0-8050-316ee5704219]
module.invitations.data.aws_iam_policy_document.invitation: Reading...
module.invitations.data.aws_iam_policy_document.invitation: Read complete after 0s [id=4041109142]
module.invitations.aws_iam_role.invitation: Refreshing state... [id=invitation]
aws_route53_record.cert_validation["*.davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]
aws_route53_record.cert_validation["davidbornitz.dev"]: Refreshing state... [id=Z04601461HBLV7APEL0VR__b5bd274a26f04dfbb4c9106ec8c08bb5.davidbornitz.dev._CNAME]
aws_acm_certificate_validation.davidbornitz: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.invitations.aws_iam_role_policy.invitation: Refreshing state... [id=invitation:invitation_policy]
module.invitations.aws_cognito_identity_pool_roles_attachment.invitation: Refreshing state... [id=us-east-2:7a98c47f-5732-41b8-a772-7d5fd220f6ed]
module.invitations.aws_s3_object.website["stadium.jpg"]: Refreshing state... [id=stadium.jpg]
module.invitations.aws_s3_bucket_website_configuration.website: Refreshing state... [id=invitation.davidbornitz.dev-f46c3b09]
module.invitations.aws_s3_object.website["styles.css"]: Refreshing state... [id=styles.css]
module.invitations.aws_s3_object.website["index.html"]: Refreshing state... [id=index.html]
module.invitations.aws_cloudfront_distribution.invitation: Refreshing state... [id=E25BUW33MYGUXP]
module.s3website["resume.davidbornitz.dev"].aws_s3_bucket_website_configuration.website: Refreshing state... [id=resume.davidbornitz.dev-c1e99e80]
module.s3website["davidbornitz.dev"].aws_s3_bucket_website_configuration.website: Refreshing state... [id=davidbornitz.dev-3a4610a4]
module.s3website["davidbornitz.dev"].aws_s3_object.website["index.html"]: Refreshing state... [id=index.html]
module.s3website["resume.davidbornitz.dev"].aws_s3_object.website["index.html"]: Refreshing state... [id=index.html]
module.s3website["resume.davidbornitz.dev"].aws_s3_object.website["styles.css"]: Refreshing state... [id=styles.css]
module.s3website["davidbornitz.dev"].aws_s3_object.website["styles.css"]: Refreshing state... [id=styles.css]
module.s3website["davidbornitz.dev"].aws_cloudfront_distribution.davidbornitz: Refreshing state... [id=ES4XGAGOUF20D]
module.s3website["resume.davidbornitz.dev"].aws_cloudfront_distribution.davidbornitz: Refreshing state... [id=E38ATFTVJ2UTVF]
module.invitations.aws_route53_record.record: Refreshing state... [id=Z04601461HBLV7APEL0VR_invitation.davidbornitz.dev_A]
module.invitations.data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.invitations.data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=2069678242]
module.invitations.aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=invitation.davidbornitz.dev-f46c3b09]
module.s3website["resume.davidbornitz.dev"].aws_route53_record.record: Refreshing state... [id=Z04601461HBLV7APEL0VR_resume.davidbornitz.dev_A]
module.s3website["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.s3website["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Reading...
module.s3website["resume.davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=1892471705]
module.s3website["davidbornitz.dev"].aws_route53_record.record: Refreshing state... [id=Z04601461HBLV7APEL0VR_davidbornitz.dev_A]
module.s3website["davidbornitz.dev"].data.aws_iam_policy_document.allow_cloudfront_access: Read complete after 0s [id=2909630262]
module.s3website["davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=davidbornitz.dev-3a4610a4]
module.s3website["resume.davidbornitz.dev"].aws_s3_bucket_policy.allow_cloudfront_access: Refreshing state... [id=resume.davidbornitz.dev-c1e99e80]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.invitations.aws_sns_topic.invitation_updates has changed
  ~ resource "aws_sns_topic" "invitation_updates" {
      + arn                         = "arn:aws:sns:us-east-2:085879623427:invitation-updates"
        id                          = "arn:aws:sns:us-east-2:085879623427:invitation-updates"
        name                        = "invitation-updates"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.invitations.data.aws_iam_policy_document.invitation_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "invitation_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-identity:*",
              + "cognito-sync:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:us-east-2:085879623427:table/invitation",
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.invitations.aws_dynamodb_table.invitation will be updated in-place
  ~ resource "aws_dynamodb_table" "invitation" {
        id                          = "invitation"
        name                        = "invitation"
        tags                        = {}
        # (9 unchanged attributes hidden)

      ~ ttl {
          + attribute_name = "TimeToExist"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.invitations.aws_iam_role_policy.invitation will be updated in-place
  ~ resource "aws_iam_role_policy" "invitation" {
        id     = "invitation:invitation_policy"
        name   = "invitation_policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cognito-sync:*",
                          - "cognito-identity:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "dynamodb:PutItem"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:us-east-2:085879623427:table/invitation"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.invitations.aws_sns_topic.invitation_updates is tainted, so must be replaced
-/+ resource "aws_sns_topic" "invitation_updates" {
      - application_success_feedback_sample_rate = 0 -> null
      ~ arn                                      = "arn:aws:sns:us-east-2:085879623427:invitation-updates" -> (known after apply)
      + beginning_archive_time                   = (known after apply)
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      ~ id                                       = "arn:aws:sns:us-east-2:085879623427:invitation-updates" -> (known after apply)
      - lambda_success_feedback_sample_rate      = 0 -> null
        name                                     = "invitation-updates"
      + name_prefix                              = (known after apply)
      ~ owner                                    = "085879623427" -> (known after apply)
      ~ policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceOwner" = "085879623427"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-east-2:085879623427:invitation-updates"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> (known after apply)
      ~ signature_version                        = 0 -> (known after apply)
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      ~ tags_all                                 = {} -> (known after apply)
      + tracing_config                           = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.invitations.aws_sns_topic_subscription.invitation will be created
  + resource "aws_sns_topic_subscription" "invitation" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "davidbornitz@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
*Pushed by: @davidbornitz, Action: `pull_request`*